---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTable.#ctor
source: html/82f2813b-0c38-d2ac-02d6-0cfb4ba7dd6e.htm
---
# Autodesk.Revit.DB.ExportLineweightTable.#ctor Method

Constructs a new ExportLineweightTable with default settings.

## Syntax (C#)
```csharp
public ExportLineweightTable()
```